content/posts/compilers.md
+++
title = "Compilers"
author = ["Jacob Chvatal"]
lastmod = 2020-11-11T08:30:57+01:00
slug = "algorithms"
draft = false
+++

Compilers translate one language to another.
They're most commonly used to translate higher level languages like C to lower level languages like Assembly.


## To Review {#to-review}

-   [explore compiler ir](https://news.ycombinator.com/item?id=23175280)
-   [cool topics to study](https://www.reddit.com/r/Compilers/comments/bg1g2w/interesting%5Ftopics%5Ffor%5Fstudy%5Fat%5Funiversity/)
    -   alternative ir structures
    -   gradual typing
    -   different type systems! (tapl)

<https://skillsmatter.com/skillscasts/14803-what-s-in-a-functional-compiler> what's in a functional compiler? talk
<https://dl.acm.org/doi/abs/10.1145/512927.512941> first work on verifying and structuring compilers
<https://hassamuddin.com/blog/reg-alloc/> overview of register allocation
<https://getpocket.com/redirect?url=https%3A%2F%2Fwww.reddit.com%2Fr%2FProgrammingLanguages%2Fcomments%2Fhvs79e%2Ftracing%5Fjit%5Fvs%5Fmethod%5Fjit%5Fwhat%5Fto%5Fchoose%2F> tracing jit vs method jit compilation -- learn the difference!

<https://groups.google.com/g/comp.arch/c/UXEi7G6WHuU/m/Z2z7fC7Xhr8J?pli=1> popcount: the NSA instruction
<https://vaibhavsagar.com/blog/2019/09/08/popcount/> more on popcount
<https://oswalt.dev/2020/11/anatomy-of-a-binary-executable/> cool article about whats inside a binary executable
[secure compilation from amal](https://m.youtube.com/watch?v=yP29TKmK3%5Fo)
